channel_api_tests/ctrip/to_ctrip/rates_update.xml

URL: http://58.221.127.196:8090/Hotel/OTAReceive/HotelRateAmountNotif.asmx

Request:

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <OTA_HotelRateAmountNotifRQ Version="2.2" PrimaryLangID="en-us" xmlns="http://www.opentravel.org/OTA/2003/05">
      <POS>
        <Source>
          <RequestorID ID="54394" Type="1" MessagePassword="qaz123">
            <CompanyName Code="C" CodeContext="4085" />
          </RequestorID>
        </Source>
      </POS>
      <RateAmountMessages HotelCode="54394">
        <RateAmountMessage>
          <StatusApplicationControl RatePlanCode="1251431" RatePlanCategory="16" />
          <Rates>
            <Rate Start="2015-10-16" End="2015-10-16">
              <BaseByGuestAmts>
                <BaseByGuestAmt Code="Sell" AmountAfterTax="5000" CurrencyCode="SGD" />
              </BaseByGuestAmts>
              <MealsIncluded Breakfast="false" />
            </Rate>
          </Rates>
        </RateAmountMessage>
      </RateAmountMessages>
    </OTA_HotelRateAmountNotifRQ>
  </soap:Body>
</soap:Envelope>


<OTA_HotelRateAmountNotifRQ Version="2.1" PrimaryLangID="en-us" TimeStamp="201-12-17T09:30:47Z" xmlns="http://www.opentravel.org/OTA/2003/05">
  <POS>
    <Source>
      <RequestorID ID="HG" MessagePassword="SamplePW" Type="1">
        <CompanyName Code="C" CodeContext="600"></CompanyName>
      </RequestorID>
    </Source>
  </POS>
  <RateAmountMessages HotelCode="29087">
    <RateAmountMessage>
      <StatusApplicationControl RatePlanCategory="16" RatePlanCode="12345" InvTypeCode="AlQQ"/>
      <Rates>
        <Rate Start="2016-08-13" End="2016-09-10">
          <BaseByGuestAmts>
            <BaseByGuestAmt Code="Sell" AmountBeforeTax="500" AmountAfterTax="600" CurrencyCode="CNY">
              <Taxes>
                <Tax Type="Exclusive" Code="28" Percent="20" CurrencyCode="CNY" ChargeUnit="19"/>
              </Taxes>
            </BaseByGuestAmt>
          </BaseByGuestAmts>
          <MealsIncluded Breakfast="true" NumberOfBreakfast="1"/>
        </Rate>
        <Rate Start="2016-09-11" End="2016-10-14">
          <BaseByGuestAmts>
            <BaseByGuestAmt Code="Sell" AmountBeforeTax="720" AmountAfterTax="720" CurrencyCode="CNY">
              <Taxes>
                <Tax Type="Inclusive" Code="28" Percent="15" CurrencyCode="CNY" ChargeUnit="19"/>
              </Taxes>
            </BaseByGuestAmt>
          </BaseByGuestAmts>
          <MealsIncluded Breakfast="true" NumberOfBreakfast="1"/>
        </Rate>
      </Rates>
    </RateAmountMessage>
    <RateAmountMessage>
      <StatusApplicationControl RatePlanCategory="501" RatePlanCode="12345" InvTypeCode="AlQQ"/>
      <Rates>
        <Rate End="2016-08-13" Start="2016-08-13">
          <BaseByGuestAmts>
            <BaseByGuestAmt Code="Sell" AmountBeforeTax="550" AmountAfterTax="550" CurrencyCode="CNY"/>
          </BaseByGuestAmts>
          <MealsIncluded Breakfast="false" />
        </Rate>
        <Rate End="2016-08-14" Start="2016-08-14">
          <BaseByGuestAmts>
            <BaseByGuestAmt Code="Sell" AmountBeforeTax="540" AmountAfterTax="540" CurrencyCode="CNY"/>
          </BaseByGuestAmts>
          <MealsIncluded Breakfast="false" />
        </Rate>
      </Rates>
    </RateAmountMessage>
  </RateAmountMessages>
</OTA_HotelRateAmountNotifRQ>
Response:

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <OTA_HotelRateAmountNotifRS TimeStamp="2015-04-24T12:36:21.5859872+08:00" Version="2.1" PrimaryLangID="en-us" xmlns="http://www.opentravel.org/OTA/2003/05">
      <Success />
      <UniqueID ID="259264369" Type="506" />
    </OTA_HotelRateAmountNotifRS>
  </soap:Body>
</soap:Envelope>